controllers/InputController.php

SELECT * FROM `a_conclusion`
---
    public function actionAssess(){

        $assess_info = Conclusion::find()->asArray()->all();