controllers/SysController.php

    public function actionUserDel(){

        $request = Yii::$app->request;
        if($request->isGet){

            $res = Personnel::deleteAll("Number=:num", array(":num"=>$request->get("num")));
---
DELETE FROM `a_personnel` WHERE Number=''

    public function actionPrint(){


            $users = Personnel::find()->all();
---
SELECT * FROM `a_personnel`