views/sys/user.php

                <tbody>

            <?php
                $users = Personnel::find()->asArray()->all();
---
SELECT * FROM `a_personnel`