module/admin/controllers/UserController.php

SELECT * FROM `case_personnel` WHERE `DepartmentNumber`='20032'
---
    public function actionUser(){

        $request = Yii::$app->request;

        if( $request->get("DepartmentNumber") ){
                $dept = $request->get("DepartmentNumber");
        }else{
               $dept = key(Department::courtList());
        }
        $users = Personnel::find()->where(["DepartmentNumber"=>$dept])->asArray()->all();