module/basic/views/default/document.php

SELECT * FROM `case_document`
---

<?php
    $i = 1;
    foreach(  Document::find()->asArray()->all() as $k=>$v ){