module/register/models/Department.php

SELECT `Number`, `Name` FROM `case_department`
---
    public static function courtList(){

        return ArrayHelper::map( Department::find()->select("Number, Name")->asArray()->all(), 'Number', 'Name');