models/LoginForm.php

    public function getUser()
    {
        if ($this->_user === false)
        {
            $this->_user = Personnel::find()->where(['Number'=>$this->username,'Password'=>$this->password, "DepartmentNumber"=>$this->court])->one();
---
SELECT * FROM `a_personnel` WHERE (`Number`='test') AND (`Password`='test')