models/Personnel.php

SELECT * FROM `a_personnel` WHERE `ID`=6
SELECT * FROM `case_personnel` WHERE `ID`=11
---
     public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['AccessToken' => $token]);